feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/iLLD/TC27D/Tricore/Multican/Can/IfxMultican_Can.h
/** \} */

/** \addtogroup IfxLld_Multican_Can_General
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Reset the CAN module.\n
 * Reset and disable the CAN module, inclusive message object and node registers.
 * \param mcan pointer to the CAN handle
 * \return None
 */
IFX_INLINE void IfxMultican_Can_deinit(IfxMultican_Can *mcan);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Return the actual CAN module configuration
 * \param mcan pointer to the CAN handle
 * \param config Pointer to the configuration structure, will be filled by this function
 * \return None
 */
IFX_EXTERN void IfxMultican_Can_getConfig(IfxMultican_Can *mcan, IfxMultican_Can_Config *config);

/** \brief Get the module frequency
 * \param mcan pointer to the CAN handle
 * \return Frequency Value
 */
IFX_EXTERN float32 IfxMultican_Can_getModuleFrequency(IfxMultican_Can *mcan);

/** \brief Initialize the CAN module\n
 * The following configuration is used:\n
 * - The CAN module is stopped during sleep mode\n
 * - The normal divider mode is selected\n
 * - The CAN module clock is the system clock
 * \param mcan pointer to the CAN handle
 * \param config Specifies pointer to the CAN module configuration
 * \return Status,: Returns IfxMultican_Status_ok if the operation was successful\n
 * Returns IfxMultican_Status_notInitialised if the operation was errorneous
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_EXTERN IfxMultican_Status IfxMultican_Can_initModule(IfxMultican_Can *mcan, const IfxMultican_Can_Config *config);

/** \brief Return the default MULTICAN configuration
 * \param config Default configuration filled by this function
 * \param mcan base address of the MULTICAN register space
 * \return None
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_EXTERN void IfxMultican_Can_initModuleConfig(IfxMultican_Can_Config *config, Ifx_CAN *mcan);

/** \} */

/** \addtogroup IfxLld_Multican_Can_Node
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Activate the CAN Node. Participate in the CAN bus activities
 * \param node Specifies the CAN node handle to be configured
 * \return None
 */
IFX_INLINE void IfxMultican_Can_Node_activate(IfxMultican_Can_Node *node);

/** \brief Deactivate the CAN Node. Take out from participation in the CAN bus activities
 * \param node Specifies the CAN node handle to be configured
 * \return None
 */
IFX_INLINE void IfxMultican_Can_Node_deactivate(IfxMultican_Can_Node *node);

/** \brief Reset the CAN node
 * \param node Specifies the CAN node handle to be configured
 * \return None
 */
IFX_INLINE void IfxMultican_Can_Node_deinit(IfxMultican_Can_Node *node);

/** \brief Recovers the CAN node from bus off
 * \param node Specifies the CAN node handle to be configured
 * \return Status
 *
 * IfxMultican_Status status = IfxMultican_Status_busOff;
 *
 * while (status != IfxMultican_Status_ok)
 * {
 *     status = IfxMultican_Can_Node_recoverBusOff(&canNode);
 * }
 *
 */
IFX_INLINE IfxMultican_Status IfxMultican_Can_Node_recoverBusOff(IfxMultican_Can_Node *node);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Get the actual message object configuration
 * \param node Specifies the CAN node handle to be configured
 * \param config Specifies the CAN node configuration
 * \return None
 */
IFX_EXTERN void IfxMultican_Can_Node_getConfig(IfxMultican_Can_Node *node, IfxMultican_Can_NodeConfig *config);

/** \brief Initialize the CAN node
 * \param node Specifies the CAN node handle to be configured
 * \param config Specifies the CAN node configuration
 * \return Status
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_EXTERN IfxMultican_Status IfxMultican_Can_Node_init(IfxMultican_Can_Node *node, const IfxMultican_Can_NodeConfig *config);

/** \brief Get default CAN node configuration
 * \param config Specifies the CAN node configuration
 * \param mcan pointer to the CAN handle
 * \return None
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_EXTERN void IfxMultican_Can_Node_initConfig(IfxMultican_Can_NodeConfig *config, IfxMultican_Can *mcan);

/** \brief Sends the CAN node into bus off
 * \param node Specifies the CAN node handle to be configured
 * \return None
 *
 * IfxMultican_Can_Node_sendToBusOff(&canNode);
 *
 */
IFX_EXTERN void IfxMultican_Can_Node_sendToBusOff(IfxMultican_Can_Node *node);

/** \} */

/** \addtogroup IfxLld_Multican_Can_Message_Objects
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Cancel pending TX request by invalidating the request\n
 * Only when frame transmission has not been started
 * \param msgObj pointer to the CAN message object handle
 * \return TRUE if cancellation was successfully executed
 */
IFX_INLINE boolean IfxMultican_Can_MsgObj_cancelSend(IfxMultican_Can_MsgObj *msgObj);

/** \brief Clear the RX pending flag of a message object
 * \param msgObj pointer to the CAN message object handle
 * \return None
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_INLINE void IfxMultican_Can_MsgObj_clearRxPending(IfxMultican_Can_MsgObj *msgObj);

/** \brief Clear the TX pending flag of a message object
 * \param msgObj pointer to the CAN message object handle
 * \return None
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_INLINE void IfxMultican_Can_MsgObj_clearTxPending(IfxMultican_Can_MsgObj *msgObj);

/** \brief Reset the message object\n
 * Append the message object to the end of idle list and reset message object registers
 * \param msgObj pointer to the CAN message object handle
 * \return None
 */
IFX_INLINE void IfxMultican_Can_MsgObj_deinit(IfxMultican_Can_MsgObj *msgObj);

